### 📖 Terraform Plan (infra-pe/resources/uat) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_dns_cname_record.portal will be updated in-place
  ~ resource "azurerm_dns_cname_record" "portal" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/cgnonboardingportal-u-public-rg/providers/Microsoft.Network/dnsZones/cgnonboardingportal-uat.pagopa.it/CNAME/portal"
        name                = "portal"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
          - "ModuleName"     = "azure_cdn" -> null
          - "ModuleSource"   = "DX" -> null
          - "ModuleVersion"  = "0.3.2" -> null
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      ~ ttl                 = 3600 -> 300
        # (5 unchanged attributes hidden)
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-attribute-authority-app-01"
        name                                           = "io-u-itn-cgn-pe-attribute-authority-app-01"
      ~ service_plan_id                                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/serverFarms/io-u-itn-cgn-pe-attribute-authority-asp-01" -> (known after apply)
      ~ tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Uat"
            "ManagementTeam"                                 = "IO CGN"
            "ModuleName"                                     = "azure_app_service"
            "ModuleSource"                                   = "DX"
          ~ "ModuleVersion"                                  = "1.0.1" -> "2.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (25 unchanged attributes hidden)

      ~ site_config {
            # (28 unchanged attributes hidden)

          ~ application_stack {
              ~ node_version             = "20-lts" -> "22-lts"
                # (12 unchanged attributes hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-attribute-authority-app-01"
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_SSL_ENABLED"     = "true"
          + "ATTRIBUTE_AUTHORITY_POSTGRES_DB_URI"             = (sensitive value)
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "NODE_ENV"                                        = "production"
          + "SERVER_PORT"                                     = "8080"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"             = "false"
          + "WEBSITES_PORT"                                   = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_NODE_DEFAULT_VERSION"                    = "18.13.0"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/ping"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          + "WEBSITE_WARMUP_PATH"                             = "/ping"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-pe-attribute-authority-app-snet-01"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "22-lts"
            }
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_private_endpoint.app_service_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "app_service_sites" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-cgn-pe-attribute-authority-app-pep-01"
        name                          = "io-u-itn-cgn-pe-attribute-authority-app-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.1" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-u-itn-cgn-pe-attribute-authority-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-u-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-u-itn-cgn-pe-attribute-authority-staging-app-pep-01"
          + private_connection_resource_id = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/sites/io-u-itn-cgn-pe-attribute-authority-app-01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.app_service_attribute_authority.module.app_service_attribute_authority.azurerm_service_plan.this[0] must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                              = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Web/serverFarms/io-u-itn-cgn-pe-attribute-authority-asp-01" -> (known after apply)
      ~ kind                            = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count    = 1 -> (known after apply)
        name                            = "io-u-itn-cgn-pe-attribute-authority-asp-01"
      ~ reserved                        = true -> (known after apply)
      ~ sku_name                        = "B1" -> "P0v3"
      ~ tags                            = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_app_service"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "1.0.1" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      ~ worker_count                    = 1 -> (known after apply)
      ~ zone_balancing_enabled          = false -> true # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.ApiManagement/service/io-u-itn-cgn-pe-apim-01"
      + min_api_version               = "2021-08-01"
        name                          = "io-u-itn-cgn-pe-apim-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg_apim" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-u-itn-cgn-pe-apim-nsg-01"
        name                = "io-u-itn-cgn-pe-apim-nsg-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (3 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net[0] will be updated in-place
  # (moved from module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net)
  ~ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net[0] will be updated in-place
  # (moved from module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net)
  ~ resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net[0] will be updated in-place
  # (moved from module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net)
  ~ resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_endpoint.apim_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "apim_pep" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-cgn-pe-apim-pep-01"
        name                          = "io-u-itn-cgn-pe-apim-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.4" -> "2.1.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 9 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.key_vaults.azurerm_key_vault.cgn_pe,
  on ../_modules/key_vaults/key_vault_cgn_pe.tf line 9, in resource "azurerm_key_vault" "cgn_pe":
   9:   enable_rbac_authorization     = true

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

(and 7 more similar warnings elsewhere)
```

</details>
